Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Hopefully this article has shown you some of the notable features that Qute template support from Quarkus Tools for Visual Studio Code has to offer and encourages you to give these a try next time you work on a Quarkus project.
ja_jp: この記事では、Quarkus Tools for Visual Studio CodeのQuteテンプレートサポートが提供する注目すべき機能のいくつかを紹介出来ていると嬉しく思います。次回Quarkusプロジェクトで作業を行う際に、これらを試してみることをお勧めします。

source: Hopefully, this will change in the future and make the error more obvious.
ja_jp: 将来的にはこの点が変わり、エラーがより明白になることが期待されます。

source: Hopefully, we'll be able to improve this soon. And the nice part is that any improvement here will benefit all applications using Hibernate ORM, not just Quarkus applications.
ja_jp: 近いうちにこれを改善できることを願っています。そして、ここでの改善は Quarkus アプリケーションだけでなく、Hibernate ORM を使用するすべてのアプリケーションに利益をもたらすという点が素晴らしいところです。

source: Host Substrate VM code substitution to help dead code elimination based on the application needs
ja_jp: Substrate VMコード置換のホストにより、アプリケーションのニーズに基づいたデッドコードの排除を支援します。

source: Host name
ja_jp: ホスト名

source: Hosting your extension in the Quarkiverse Hub makes it available to all Quarkus users through the Quarkus tooling.
ja_jp: エクステンションをQuarkiverse Hubでホスティングすると、Quarkusツールを介してすべてのQuarkusユーザーが利用できるようになります。

source: Hostname verification is the process of verifying the server's identity.
ja_jp: ホスト名の検証は、サーバーのアイデンティティーを検証するプロセスです。

source: Hostnames or IP addresses that should bypass the proxy
ja_jp: プロキシーをバイパスする必要があるホスト名または IP アドレス

source: Hot Reload
ja_jp: ホットリロード

source: Hot Reload of the Maven process
ja_jp: Maven プロセスのホットリロード

source: Hot path performance optimization
ja_jp: ホットパスパフォーマンスの最適化

source: Hot reload
ja_jp: ホットリロード

source: Hot reload is not working for logo changes, and remember browser cache, you might need to https://refreshyourcache.com/en/cache/[force refresh] your browser.
ja_jp: ホットリロードは、ロゴ変更には動作しません。とブラウザのキャッシュを覚えておいてください。ブラウザを https://refreshyourcache.com/en/cache/[強制的にリフレッシュする]必要があるかもしれません。

source: How Leyden works
ja_jp: Leyden の仕組み

source: How Polaris Leverages Quarkus
ja_jp: Polaris が Quarkus をどのように活用するか

source: How Project Leyden brought a new perspective
ja_jp: Project Leyden がもたらした新しい視点

source: How Quarkus has been used to deploy applications on OpenShift
ja_jp: OpenShift上のアプリケーションのデプロイにQuarkusがどのように使用されたか。

source: How To Eliminate False Positives
ja_jp: 誤検知を排除する方法

source: How To Exclude Types and Dependencies from Discovery
ja_jp: ディスカバリーから型と依存関係を除外する方法

source: How about compiling this app to https://quarkus.io/guides/building-native-image[native] next to deploy an extremely lightweight webapp? Or you may want to look at some of other https://www.patternfly.org/v4/get-started/develop/[Patternfly components] to create a more sophisticated web interface. Either way there no boundaries except for your creativity to make you Quarkus apps shine.
ja_jp: このアプリを次は link:https://quarkus.io/guides/building-native-image[ネイティブ]にコンパイルして、極めて軽量なWebアプリを展開するのはどうでしょうか。あるいは、他の link:https://www.patternfly.org/v4/get-started/develop/[Patternflyコンポーネント]を使用して、より洗練されたウェブインターフェイスを作成することもできます。いずれにしても、Quarkusアプリを輝かせるためには、あなたの創造性以外に制限はありません。

source: How and why we simplify Hibernate ORM mappings
ja_jp: Hibernate ORMマッピングを単純化する方法と理由

source: How and why we simplify Hibernate Reactive mappings
ja_jp: HibernateのReactiveマッピングを単純化する方法と理由

source: How and why we simplify MongoDB API
ja_jp: MongoDB の API をシンプルにする方法と理由

source: How can I change the code of things on the classpath?
ja_jp: クラスパス上のコードを変更するにはどうすればよいですか?

source: How can I ensure a build step always runs even if it doesn't produce anything consumed by another build step?
ja_jp: 他のビルドステップによって消費されるものを何も生成しない場合でも、ビルドステップを常に実行させる方法

source: How can I have a build step do something after a Dev Service is started?
ja_jp: Dev Service の開始後にビルドステップで何かを実行するにはどうすればよいですか。

source: How can I make my extension support the Dev UI?
ja_jp: エクステンションをDev UIに対応させるにはどうすればいいですか?

source: How can I publish links to my service in the Dev UI?
ja_jp: Dev UI でサービスへのリンクを公開するにはどうすればよいですか。

source: How can I redirect application logging to an external service?
ja_jp: アプリケーションログを外部サービスにリダイレクトするにはどうすればよいですか?

source: How can I try it out?
ja_jp: どうやって試してみたらいいのでしょうか?

source: How can we improve as an ecosystem?
ja_jp: エコシステム全体としてどのように改善できるか

source: How can we troubleshoot performance problems only reproducible in production?
ja_jp: 本番環境でのみ再現可能なパフォーマンスの問題をどのようにトラブルシューティングできますか?

source: How can we work around this?
ja_jp: どうすれば回避できるのか？

source: How capabilities are implemented and used in Quarkus.
ja_jp: Quarkusでのケイパビリティの実装、使用方法

source: How client secret should be submitted or used
ja_jp: クライアントシークレットをどのように送信または使用するか

source: How come this Quarkus native executable consumes ~35MB RSS on startup? To get an understanding of this number, this section will use `perf` to trace calls to `syscalls:sys_enter_mmap`. Assuming the default link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement/#serial-garbage-collector[GraalVM Serial Garbage Collector] is in use, this system call is particularly interesting for native executables generated by GraalVM's `native-image` because of how it allocates heap. In native executables generated by GraalVM's `native-image`, the heap is allocated using either aligned or unaligned heap chunks. All non-array objects get allocated in thread local aligned chunks. Each of these are 1MB in size by default. For arrays, if they are bigger than 1/8 of the aligned chunk size, they will be allocated in unaligned heap chunks which have a size dependant on the object itself. The very first time a thread allocates an object or small array, it will request an aligned heap chunk that it will use exclusively until it has run out of space in that chunk, in which case it will request another aligned heap chunk. So by tracing these system calls, the code paths that end up requesting new aligned or unaligned heap chunks will be recorded. Next, run the Quarkus native executable through `perf record` tracing the `mmap` system call:
ja_jp: この Quarkus ネイティブ実行可能ファイルは、起動時に約 35 MB の RSS を消費するのはなぜでしょうか? この数値を理解するために、このセクションでは `perf` を使用して `syscalls:sys_enter_mmap` への呼び出しをトレースします。 デフォルトの link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement/#serial-garbage-collector[GraalVM シリアルガベージコレクター] が使用されている場合、 このシステムコールは、GraalVM の `native-image` によって生成されたネイティブ実行可能ファイルにとって特に重要です。これは、ヒープの割り当て方法に関係しています。 GraalVM の `native-image` によって生成されたネイティブ実行可能ファイルでは、ヒープはアラインメントされたヒープチャンクまたはアラインメントされていないヒープチャンクのいずれかを使用して割り当てられます。 すべての非配列オブジェクトは、スレッドローカルに揃えられたチャンクに割り当てられます。 これらはそれぞれデフォルトで 1MB のサイズです。 配列の場合、整列されたチャンクサイズの 1/8 より大きい場合、 これらは、整列されていないヒープチャンクに割り当てられ、オブジェクト自体のサイズに依存します。 スレッドが初めてオブジェクトや小さな配列を割り当てると、専用のヒープ領域 (チャンク) を確保し、その中の空きスペースがなくなるまでそのスレッドだけが使う仕組みになっています。 その場合、別の整列ヒープチャンクを要求します。 これらのシステムコールをトレースすることで、 最終的に新しい整列されたヒープチャンクまたは整列されていないヒープチャンクを要求するコードパスが記録されます。 次に、 `mmap` システムコールをトレースする `perf record` を通じて、Quarkus ネイティブ実行可能ファイルを実行します。

source: How credentials are applied
ja_jp: クレデンシャルが適用される方法

source: How dev mode differs from a production application
ja_jp: 開発モードと本番アプリケーションの差異

source: How dev-mode differs from a production application
ja_jp: dev-modeと本番アプリケーションの差異

source: How do I edit this file and get content assist?
ja_jp: このファイルの編集時にコンテンツアシスト機能を利用する方法

source: How do I enable GC logging in native executables?
ja_jp: ネイティブ実行可能ファイルでGCロギングを有効にするにはどうすればいいですか？

source: How do I know if my application suffers from similar problems? Aside from a deep study of the application, finding usages of https://maven.apache.org/guides/introduction/introduction-to-optional-and-excludes-dependencies.html[Maven optional dependencies] is a clear indicator that your application might suffer from similar problems. These type of dependencies should be avoided, and instead code that interacts with optional dependencies should be moved into separate modules.
ja_jp: アプリケーションに同様の問題があるかどうかを確認するにはどうすればよいですか? アプリケーションの詳細な調査は別として、 https://maven.apache.org/guides/introduction/introduction-to-optional-and-excludes-dependencies.htmlMaven のオプションの依存関係 の使用法を見つけることは、アプリケーションで同様の問題が発生する可能性があります。この種の依存関係は避けるべきであり、代わりに、オプションの依存関係と対話するコードは別のモジュールに移動する必要があります。

source: How do I know what kind of capabilities I might want to include in an extension?
ja_jp: エクステンションに追加すべきケイパビリティーの種類を知る方法

source: How do I scale a Quarkus Web Application?
ja_jp: Quarkus Web アプリケーションをスケーリングするにはどうすればよいですか?

source: How do I sign-up?
ja_jp: どうやったら申し込めますか?

source: How do we measure memory usage
ja_jp: メモリ使用量の測定方法

source: How do we measure startup time
ja_jp: 起動時間の測定方法

source: How does Quarkus enable Reactive?
ja_jp: Quarkusはどのようにしてリアクティブを実現するのですか？

source: How does Quarkus make your native executable smaller using UPX
ja_jp: QuarkusでUPXを使用してネイティブ実行可能ファイルを小さくする方法

source: How does it compare to RESTEasy Classic with Mutiny?
ja_jp: RESTEasy Classic with Mutiny との比較はどうでしょうか?

source: How does the Quarkus Platform help?
ja_jp: Quarkusプラットフォームの利点

source: How does the central lifecycle management decide whether a service can be re-used? This is based on 'sameness keys' (the config objects) passed in to the builder to use as the basis for the comparison.
ja_jp: 一元化されたライフサイクル管理は、サービスが再利用可能かどうかをどのように判断するのでしょうか。これは、比較の基準として使用するためにビルダーに渡される「同一性キー」(設定オブジェクト) に基づいています。

source: How it works
ja_jp: 動作原理

source: How it works: Go -> Wasm -> Java bytecode
ja_jp: 仕組み: Go -> Wasm -> Java バイトコード

source: How long (ms) will automatic recovery wait before attempting to reconnect Type: _int_
ja_jp: 再接続を試行する前に自動回復が待機する時間 (ミリ秒) Type: _int_

source: How the authentication JWT token is produced
ja_jp: 認証 JWT トークンがどのように作成されるか

source: How the result should be displayed (see the `Display` section below)
ja_jp: 結果の表示方法 (以下の `Display` セクションを参照)

source: How the story started
ja_jp: 物語の始まり

source: How the various Quarkus package types are cached in non-CI and CI environments is described in the following table. Note that even if a task's output is not _cached_, the _up-to-date_ checks still apply.
ja_jp: 次の表は、さまざまな Quarkus パッケージタイプが非 CI 環境と CI 環境でどのようにキャッシュされるかを示しています。 タスクの出力が _キャッシュ_ されない場合も _up-to-date_ は適用されることに注意してください。

source: How to Add SmallRye JWT directly
ja_jp: SmallRye JWT を直接追加する方法

source: How to Add the Dev Assistant
ja_jp: Dev Assistant の追加方法

source: How to Configure Logging for `@QuarkusTest`
ja_jp: `@QuarkusTest` のログ設定方法

source: How to Create Quarkus Documentation
ja_jp: Quarkusドキュメントの作成方法

source: How to Enable Trace Logging for Annotation Transformers
ja_jp: Annotation TransformerのTrace Loggingを有効にする方法

source: How to Enable Trace Logging for Request Context Activation
ja_jp: リクエストコンテキストのアクティブ化のトレースログを有効にする方法

source: How to Generate a Jandex Index
ja_jp: Jandex インデックスを生成する方法

source: How to Identify a Problematic Part of the Template
ja_jp: テンプレートの問題個所の特定方法

source: How to Override a Bean Defined by a Library/Quarkus Extension that doesn't use @DefaultBean
ja_jp: @DefaultBean を使用しない Library/Quarkus エクステンションによって定義された Bean をオーバーライドする方法

source: How to add SmallRye JWT directly
ja_jp: SmallRye JWT を直接追加する方法

source: How to avoid using private members? You can use package-private modifiers:
ja_jp: プライベートメンバーの使用を回避するには、package-private 修飾子を使うことができます。

source: How to be notified of new connections and disconnections
ja_jp: 新しい接続と切断の通知を受け取る方法

source: How to broadcast messages to all connected users
ja_jp: 接続しているすべてのユーザーにメッセージをブロードキャストする方法

source: How to build a Quarkus application using AMQP in less than 10 minutes
ja_jp: AMQPを使用したQuarkusアプリケーションを10分以内に構築する方法

source: How to build a Quarkus application using Apache Kafka in less than 10 minutes
ja_jp: Apache Kafkaを使用したQuarkusアプリケーションを10分以内に構築する方法

source: How to check the errors in the logs
ja_jp: ログでエラーを確認する方法

source: How to combine it with HTTP Security Policy
ja_jp: HTTP セキュリティーポリシーとの組み合わせ方法

source: How to configure a global proxy
ja_jp: グローバルプロキシーの設定方法

source: How to configure named proxies
ja_jp: 名前付きプロキシーの設定方法

source: How to contribute documentation
ja_jp: ドキュメントの寄稿方法

source: How to control the amount of magic from Quarkus
ja_jp: Quarkusのマジックの量をコントロールする方法

source: How to customize authentication exception responses
ja_jp: 認証の例外応答をカスタマイズする方法

source: How to declare a web socket endpoint
ja_jp: Web ソケットエンドポイントを宣言する方法

source: How to disable analytics?
ja_jp: 分析を無効にするには？

source: How to execute logic when HTTP server started
ja_jp: HTTP サーバーの起動時にロジックを実行する方法

source: How to expose configuration
ja_jp: 設定を公開する方法

source: How to integrate with a Credentials Provider
ja_jp: クレデンシャルプロバイダーとの統合方法

source: How to observe events without touching the streams.
ja_jp: ストリームに触れずにイベントを観察する方法

source: How to obtain plugins
ja_jp: プラグインの入手方法

source: How to re-augment a Quarkus application
ja_jp: Quarkusのアプリケーションを再オーグメンテーションする方法

source: How to send and receive Cloud Events with Quarkus, Kafka and Reactive Messaging
ja_jp: Quarkus、Kafka、Reactive Messagingを使用してクラウドイベントを送受信する方法

source: How to send and receive messages using web sockets
ja_jp: Web ソケットを使用してメッセージを送受信する方法

source: How to use 'client-id' property
ja_jp: 'client-id' プロパティーの使用方法

source: How to use Kafka and Avro in a native executable
ja_jp: ネイティブ実行可能ファイルでKafkaとAvroを使用する方法

source: How to use _path parameters_ in web socket URLs
ja_jp: Web ソケット URL で _パスパラメーター_ を使用する方法

source: How to use custom Redis Commands
ja_jp: カスタムRedisコマンドの使用方法

source: How to use multiple scheduler implementations
ja_jp: 複数のスケジューラー実装を使用する方法

source: How to use the `quarkus-websockets-next` extension
ja_jp: `quarkus-websockets-next` エクステンションの使い方

source: How to use the narayana LRA extension to create reliable long running activities.
ja_jp: 信頼性の高いロングラン活動を実現するためのnarayana LRAエクステンションの使用方法。

source: How to use virtual threads in a REST application
ja_jp: RESTアプリケーションで仮想スレッドを使用する方法

source: How we integrated Project Leyden into Quarkus
ja_jp: Project Leyden を Quarkus に統合した方法

source: How will this work?
ja_jp: これはどのように機能するのでしょうか？

source: How your resource is represented on the wire, can vary depending on content types
ja_jp: 通信上でのリソースの表現方法は、Content typeによって異なります。

source: How-To Guide
ja_jp: ハウツーガイド

source: How-To Guides
ja_jp: ハウツーガイド

source: How-To guides
ja_jp: ハウツーガイド

source: How-to Guides
ja_jp: ハウツーガイド

source: How-to guides
ja_jp: ハウツーガイド

source: How-to guides are _directions_ that take the reader through the steps required to solve a real-world problem. How-to guides are _goal-oriented_.
ja_jp: ハウツーガイドは、実際の問題を解決するために必要な手順を読者に _指示_ します。ハウツーガイドは _目標を重視_ しています。

source: How-to guides should end in `-howto.adoc`
ja_jp: ハウツーガイドは `-how.adoc` で終わるべきである。

source: However it is also possible to specify the profile directly in the POM file of the project using project properties, the Quarkus Maven plugin configuration properties or system properties set in the Quarkus Maven plugin configuration.
ja_jp: ただし、プロジェクトプロパティー、Quarkus Maven プラグイン設定プロパティー、または Quarkus Maven プラグイン設定で設定されたシステムプロパティーを使用して、プロジェクトの POM ファイルでプロファイルを直接指定することもできます。

source: However it is likely your Keycloak configuration may be more complex and require setting more properties.
ja_jp: ただし、Keycloak の設定はこれよりも複雑で、より多くのプロパティーを設定する必要があると思われます。

source: However, HTTP characteristics prohibit implementing <a href="https://www.reactivemanifesto.org/">reactive systems</a>, where all the components interact using asynchronous messages passing.
ja_jp: しかし、HTTPの特性上、すべてのコンポーネントが非同期のメッセージパッシングを使って相互に作用するような<a href="https://www.reactivemanifesto.org/">リアクティブシステム</a>を実装することはできません。

source: However, HTTP characteristics prohibit implementing fully https://www.reactivemanifesto.org/[reactive systems], where all the components interact using asynchronous messages passing. You can consume messages from various brokers, such as Apache Kafka, Apache Pulsar, or RabbitMQ, and process these messages smoothly:
ja_jp: しかしながら、HTTP の特性により、すべてのコンポーネントが非同期メッセージ パッシングを使用して対話する完全な https://www.reactivemanifesto.org/[リアクティブ システム] を実装することはできません。Apache Kafka、Apache Pulsar、RabbitMQ などのさまざまなブローカーからメッセージを消費し、これらのメッセージをスムーズに処理できます。

source: However, Permission Based Access Control is better suited to the case where an access token is propagated by the front-end endpoint to a microservice which will check if a given access token has been authorized for this service to perform a concrete action, as opposed to this token vouching for a user be in a specific role. For example, being in the admin role does not necessarily mean the user is allowed to have a read and write access to some of this microservice's content.
ja_jp: ただし、フロントエンドのエンドポイントからマイクロサービスにアクセストークンを伝播する場合は、権限ベースのアクセス制御が適しています。これは、ユーザーが特定のロールを持つことをトークンが保証するのではなく、特定のアクセストークンがこのサービスに対してそのアクションを実行するために承認されているか確認します。たとえば、管理者ロールを持つからといって、必ずしもそのユーザーがこのマイクロサービスのコンテンツの一部に対する読み取りおよび書き込みを許可されるわけではありません。

source: However, `@RequestScoped` must be used when the individual token claims are injected as simple types such as `String`, for example:
ja_jp: ただし、個々のトークンクレームが `String` などの単純な型として挿入される場合は、 `@RequestScoped` を使用する必要があります。以下はその例です。

source: However, an endpoint method using `@Blocking` in RESTEasy Reactive still achieves around 50% higher throughput than the same method using RESTEasy Classic.
ja_jp: しかし、RESTEasy Reactive で `@Blocking` を使用したエンドポイントメソッドでは、RESTEasy Classic を使用した同じメソッドよりも約 50% 高いスループットを達成しています。

source: However, as said in the introduction, nothing comes for free. Earlier, we also measured the memory usage of the uncompressed executable (21 MB). Let's compare with the compressed executable.
ja_jp: しかし、冒頭で述べたように、タダで手に入るものはありません。先ほど、圧縮されていない実行可能ファイルのメモリ使用量（21MB）も測定しました。圧縮した実行可能ファイルと比較してみましょう。

source: However, be aware that directly inlining private keys in the configuration is not recommended. Use the `smallrye.jwt.sign.key` property only when you need to fetch a signing key value from a remote secret manager.
ja_jp: ただし、設定に秘密鍵を直接インライン化することは推奨されない点に注意してください。リモートシークレットマネージャーから署名キーの値を取得する必要がある場合にのみ、 `smallrye.jwt.sign.key` プロパティーを使用してください。

source: However, by default, with the `pause-if-no-requests=true` configuration, the connector handles automatically the back-pressure, by the pausing and resuming the Kafka consumer based on downstream requests. It is therefore recommended to use pausable channels with the default `pause-if-no-requests=true` configuration.
ja_jp: ただし、デフォルトでは、`pause-if-no-requests=true` 設定により、コネクターはダウンストリームのリクエストに基づいて Kafka コンシューマーを一時停止および再開し、自動的にバックプレッシャーを処理します。 したがって、デフォルトの `pause-if-no-requests=true` 設定で一時停止可能なチャネルを使用することを推奨します。

source: However, depending on your OIDC provider, roles might be stored in the access token or the user info.
ja_jp: ただし、OIDC プロバイダーによっては、ロールがアクセストークンまたはユーザー情報に保存される場合があります。

source: However, direct end-to-end Bearer token propagation should be avoided. For example, `Client -> Service A -> Service B`, where `Service B` receives a token sent by `Client` to `Service A`. In such cases, `Service B` cannot distinguish whether the token came from `Service A` or directly from `Client`. For `Service B` to verify that the token originated from `Service A`, it should be able to assert new issuer and audience claims.
ja_jp: ただし、エンドツーエンドの直接的なベアラートークン伝播は避けるべきです。たとえば、 `Client -> Service A -> Service B` の場合、 `Service B` は `Client` から `Service A` に送信されたトークンを受信します。このような場合、 `Service B` はトークンが `Service A` から送信されたのか、直接 `Client` から送信されたのかを区別できません。`Service B` で、トークンの送信元が `Service A` であることを確認するには、新しい発行者とオーディエンスのクレームをアサートできる必要があります。

source: However, do not think it all comes for free. While the gain on disk space is fantastic, do not ignore the RSS overhead.
ja_jp: しかし、すべてが無料で手に入るとは思わないでください。ディスクスペースを得るのは素晴らしいものですが、RSSのオーバーヘッドを無視してはいけません。

source: However, due to an HTTP redirect required to complete the code authentication flow for the OIDC `web-app` applications, a custom HTTP cookie may be needed to select the same tenant configuration before and after this redirect request because:
ja_jp: ただし、OIDC `web-app` アプリケーションのコード認証フローを完了するために HTTP リダイレクトが必要なため、次の理由により、このリダイレクトリクエストの前後に同じテナント設定を選択するためにカスタム HTTP Cookie が必要になる場合があります。

source: However, even this single OIDC client secret property may be treated in four different ways, depending on how a specific provider expects it be used: be sent alongside `quarkus.oidc.client-id` as an HTTP `Authorization: Basic` credentials pair (default), as an HTTP POST form parameter, or even as a query parameter (as expected by the xref:security-openid-connect-providers.adoc#strava[Strava OAuth2 provider]), or is used as a placeholder for a generated JWT token for the xref:security-oidc-code-flow-authentication.adoc#apple-post-jwt[Apple client authentication].
ja_jp: しかし、この単一の OIDC クライアントシークレットプロパティーであっても、特定のプロバイダーがどのように使用されることを期待しているかに応じて、 4 つの異なる方法で扱われる可能性があります。 `quarkus.oidc.client-id` と共に HTTP `Authorization: Basic` クレデンシャルペアとして送信される (デフォルト) 、 HTTP POST フォームパラメーターとして送信される、あるいは ( xref:security-openid-connect-providers.adoc#strava[Strava OAuth2 プロバイダー] で期待されるように) クエリーパラメーターとして送信される、さらには xref:security-oidc-code-flow-authentication.adoc#apple-post-jwt[Apple クライアント認証] 用に生成された JWT トークンのプレースホルダーとして使用される、といったケースがあります。

source: However, if the requirement is for the current application to log the user out of a specific application only, you can override the global end-session URL by setting the `quarkus.oidc.end-session-path=logout` parameter.
ja_jp: ただし、現在のアプリケーションで特定のアプリケーションからのみユーザーをログアウトさせる必要がある場合は、 `quarkus.oidc.end-session-path=logout` パラメーターを設定することで、グローバルエンドセッション URL を上書きできます。

source: However, if you already have all the required `quarkus-oidc` properties configured, then you only need to associate `quarkus.oidc.auth-server-url` with the `prod` profile for `Dev Services for Keycloak` to start a container. For example:
ja_jp: ただし、必要なすべての `quarkus-oidc` プロパティーがすでに設定されている場合は、 `quarkus.oidc.auth-server-url` を `Dev Services for Keycloak` の `prod` プロファイルに関連付けるだけで、コンテナーを起動できます。 以下に例を示します。

source: However, if you do prefer to continue following a stateful approach, you can easily achieve it with Quarkus OIDC.
ja_jp: ただし、ステートフルなアプローチを継続したい場合は、Quarkus OIDC で簡単に実現できます。

source: However, if you have already configured the required `quarkus-oidc` properties, then you only need to associate `quarkus.oidc.auth-server-url` with the `prod` profile for `Dev Services for Keycloak` to start a container, as shown in the following example:
ja_jp: ただし、必要な `quarkus-oidc` プロパティーをすでに設定している場合は、次の例に示すように、 `quarkus.oidc.auth-server-url` を `prod` プロファイルに関連付けるだけで、`Dev Services for Keycloak` がコンテナーを起動できます。

source: However, if you have already configured the required `quarkus-oidc` properties, then you only need to associate `quarkus.oidc.auth-server-url` with the `prod` profile for `Dev Services for Keycloak`to start a container, as shown in the following example:
ja_jp: ただし、必要な `quarkus-oidc` プロパティーをすでに設定している場合は、次の例に示すように、 `quarkus.oidc.auth-server-url` を `Dev Services for Keycloak` の `prod` プロファイルに関連付けるだけで、コンテナーを起動できます。

source: However, if you have designed your application with an expectation that the code flow access token, typically in JWT format, can be used as a source of roles or other information relevant to your application then do `quarkus.oidc.authentication.verify-access-token=true`. Quarkus enables this property automatically if it can detect that `JsonWebToken` without an `@IdToken` qualifier is injected in the application code, indicating that the application intends to access a code flow access token.
ja_jp: ただし、通常 JWT 形式であるコードフローアクセストークンを、ロールやアプリケーションに関連するその他の情報のソースとして使用することを想定してアプリケーションを設計した場合は、`quarkus.oidc.authentication.verify-access-token=true` を設定してください。Quarkus は、アプリケーションコードに `@IdToken` 修飾子のない `JsonWebToken` が注入されていることを検出した場合、アプリケーションがコードフローアクセストークンへのアクセスを意図していると判断し、このプロパティーを自動的に有効にします。
